app/views/welcome/index.html.erb

SELECT  1 AS one FROM `behaviors` WHERE `behaviors`.`deal_id` = 5 AND `behaviors`.`user_id` = 1 LIMIT 1
SELECT `behaviors`.* FROM `behaviors` WHERE `behaviors`.`deal_id` = 5
---
            <% if user_signed_in? %>
              <% if @hot_deal.behaviors.exists? user_id: current_user.id  %>

SELECT COUNT(*) FROM `comments` WHERE `comments`.`deal_id` = 5
---
            <div class="col-xs-6"><p class="category"><a href=""><%= @hot_deal.category.description %></a></p></div>
            <div class="col-xs-6 right"><p class="comments"><a href=""><%= @hot_deal.comments.count %> <%= fa_icon 'comment' %></a></p></div>