app/views/deals/show.html.erb

SELECT `comments`.* FROM `comments` WHERE `comments`.`deal_id` = 9
---
            </div>
            <p class="comments"><a href="#box-comm"><%= @deal.comments.count %> <%= fa_icon 'comment' %></a></p>

SELECT  1 AS one FROM `behaviors` WHERE `behaviors`.`deal_id` = 9 AND `behaviors`.`user_id` = 2 LIMIT 1
SELECT `behaviors`.* FROM `behaviors` WHERE (user_id = 1 AND deal_id = 9)
---
                  <% if user_signed_in? %>
                    <% if @deal.behaviors.exists? user_id: current_user.id  %>

SELECT  1 AS one FROM `comments` WHERE `comments`.`deal_id` = 9 LIMIT 1
---
          <h4><i class="fa fa-comment" aria-hidden="true"></i> <%= @deal.comments.where('status = 1').count %> Comentarios</h4>
            <% if @deal.comments.exists? %>