app/controllers/behaviors_controller.rb

SELECT `behaviors`.* FROM `behaviors`
---
  def index
    @behaviors = Behavior.all

INSERT INTO `behaviors` (`grade`, `user_id`, `deal_id`, `created_at`, `updated_at`) VALUES (1, 1, 1, '2017-05-13 17:16:01', '2017-05-13 17:16:01')
---
  def create
    @behavior = Behavior.new(behavior_params)

    respond_to do |format|
      if @behavior.save

SELECT  `behaviors`.* FROM `behaviors` WHERE `behaviors`.`id` = 1 LIMIT 1
---
    def set_behavior
      @behavior = Behavior.find(params[:id])