app/controllers/comments_controller.rb

  def index
    @comments = Comment.all
---
SELECT `comments`.* FROM `comments`

  def create
    @comment = Comment.new(comment_params)
    @comment.status = 2
    respond_to do |format|
      if @comment.save
---
INSERT INTO `comments` (`description`, `user_id`, `deal_id`, `created_at`, `updated_at`) VALUES ('asdasdasdas', 1, 9, '2017-05-13 17:51:33', '2017-05-13 17:51:33')

    def set_comment
      @comment = Comment.find(params[:id])
---
SELECT  `comments`.* FROM `comments` WHERE `comments`.`id` = 1 LIMIT 1