app/controllers/deals_controller.rb

  def index
    @deals = Deal.all
---
SELECT `deals`.* FROM `deals`

  def show
    id = params[:id].split('-')
    @report = Report.where('deal_id ='+id[0])
    @banners = Banner.order("RAND()").limit(3)
    @related = Deal.where('category_id ='+ @deal.category.id.to_s).where('id !='+id[0]).where('created_at >= ?', 1.week.ago).order("RAND()").limit(3)
    @pricesMin = Price.select('*')
      .joins('LEFT JOIN deals on deals.id = prices.Deal_id')
      .where('prices.created_at > ?', 30.days.ago)
      .where('prices.Deal_id = '+id[0].to_s)
      .group('prices.store').group_by_hour('prices.created_at').minimum(:price)
    if current_user.try(:admin?)

    else
      @banners.each do |banner|
        banner.impressions = banner.impressions + 1
        banner.save
      end
      if @deal.impressions.nil?
        @deal.impressions = 0
      end
      @deal.impressions += 1
      @deal.save
    end
    if @deal.mpn.present?
---
UPDATE `deals` SET `rank` = 98, `updated_at` = '2017-05-13 17:39:12' WHERE `deals`.`id` = 9
SELECT  `categories`.* FROM `categories` WHERE `categories`.`id` = 3 LIMIT 1
SELECT  `deals`.* FROM `deals` WHERE `deals`.`id` = 1 LIMIT 1
SELECT  `stores`.* FROM `stores` WHERE `stores`.`id` = 2 LIMIT 1

  def new
    @deal = Deal.new
    @categories = Category.all
    @stores = Store.all
---
SELECT  `categories`.* FROM `categories` ORDER BY `categories`.`id` ASC LIMIT 1
SELECT `stores`.* FROM `stores`

  def edit
    @categories = Category.all
---
SELECT `categories`.* FROM `categories`

  def create
    @deal = Deal.new(deal_params)
    @deal.user_id = nil
    if user_signed_in?
      @deal.user_id = current_user.id
    end
    @deal.status = 0
    @deal.rank = 0
    respond_to do |format|
      if @deal.save
---
INSERT INTO `deals` (`title`, `description`, `imagen`, `link`, `price`, `expiration`, `user_id`, `type_deal`, `created_at`, `updated_at`, `promoimage_file_name`, `promoimage_content_type`, `promoimage_file_size`, `promoimage_updated_at`, `category_id`, `status`) VALUES ('Best Buy - Estufa de Piso ', ' DESCRIPCIÓN La Estufa de Piso Acros 30\" cuenta con respaldo porcelanizado con placa marca, 3 parrillas de alambrón con diseño de dedos, 6 quemadores de aluminio, cubierta de acero inoxidable totalmente sellada, perillas ergonómicas con puntero cromado. Envío únicamente a D.F y Zona Metropolitana, Guadalajara, San Luis Potosí, Morelia y Monterrey. Consulta códigos postales de entrega.”', '', '', '5500', '23-07-20', 1, 1, '2017-05-13 05:27:24', '2017-05-13 05:27:24', 'IMG_20042017_175027_0.png', 'image/png', 4725, '2017-05-13 05:27:23', 15, 0)

  def rank
    promoid = params['promoid']
    @deal =  Deal.find(promoid)
    number = params['number']
    if number == "positive"
      number = "1"
      @deal.rank = @deal.rank.to_i + 1
    else
      number = "0"
      @deal.rank = @deal.rank.to_i - 1
    end
    @deal.save
    userid = 1
    if user_signed_in?
      userid = current_user.id
    end
    @behavior = Behavior.all.where('user_id = '+userid.to_s).where('deal_id ='+promoid.to_s)
    if @behavior.exists?
      respond_to do |format|
         format.html
         format.js {}
         format.json {
            render json: {:message => 'error'}
        }
      end
    else
    @behavior = Behavior.new(grade: number, user_id: userid, deal_id: promoid)
    @behavior.save
---
SELECT  `deals`.* FROM `deals` WHERE `deals`.`id` = 1 LIMIT 1
UPDATE `deals` SET `rank` = 100, `updated_at` = '2017-05-13 17:38:08' WHERE `deals`.`id` = 9
INSERT INTO `behaviors` (`grade`, `user_id`, `deal_id`, `created_at`, `updated_at`) VALUES (1, 1, 1, '2017-05-13 17:27:54', '2017-05-13 17:27:54')

  def validatelink
    url_host = params['url_host'].to_s;
    @deals = Deal.all.where('link LIKE "%'+url_host+'%"')
    if @deals.exists?
---
SELECT `deals`.* FROM `deals` WHERE (link = "https://www.amazon.com.mx/dp/B01F3ENAOU/?tag=pdesc-20")
SELECT  1 AS one FROM `deals` WHERE (link LIKE "%https://www.amazon.com.mx/Fidget-Spinner-Juguete-Anti-Estr%C3%A9s-Cer%C3%A1mica/dp/B01N1UTEZE/ref=sr_1_1?ie=UTF8&qid=1495593959&sr=8-1%") LIMIT 1

  def update
    respond_to do |format|
      if @deal.update(deal_params)
---
UPDATE `deals` SET `imagen` = '#<ActionDispatch::Http::UploadedFile:0x007fc82ad981a0>', `promoimage_file_name` = '1000205861_x1.jpg', `promoimage_file_size` = 90936, `promoimage_updated_at` = '2017-05-23 02:44:34', `updated_at` = '2017-05-23 02:44:34' WHERE `deals`.`id` = 5

  def destroy
    @deal.destroy
---
DELETE FROM `deals` WHERE `deals`.`id` = 1

    def set_deal
      @deal = Deal.find(params[:id])
---
SELECT  `deals`.* FROM `deals` WHERE `deals`.`id` = 7 LIMIT 1