app/controllers/deals_controller.rb

  def moderate
    if params[:status].present?
      @deals = Deal.where('status = '+params[:status])
    else
      @deals = Deal.all
---
SELECT `deals`.* FROM `deals`