app/controllers/stores_controller.rb

  def index
    @stores = Store.all
---
SELECT `stores`.* FROM `stores`

  def create
    @store = Store.new(store_params)

    respond_to do |format|
      if @store.save
---
INSERT INTO `stores` (`description`, `created_at`, `updated_at`) VALUES ('Amazon', '2017-05-24 03:01:53', '2017-05-24 03:01:53')

    def set_store
      @store = Store.find(params[:id])
---
SELECT  `stores`.* FROM `stores` WHERE `stores`.`id` = 1 LIMIT 1