app/controllers/welcome_controller.rb

SELECT  `deals`.* FROM `deals` WHERE `deals`.`id` = 2 LIMIT 1
SELECT `deals`.* FROM `deals`
---
  def index
    @deals = Deal.all.order('created_at DESC').page(params[:page]).per(9)
    @hot_deal = Deal.find(10)
    @top_voted = Deal.all